{
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workbookDisplayName": {
      "type": "string",
      "defaultValue": "MFA - Gap Analysis",
      "metadata": {
        "description": "The friendly name for the workbook that is used in the Gallery or Saved List.  This name must be unique within a resource group."
      }
    },
    "workbookType": {
      "type": "string",
      "defaultValue": "sentinel",
      "metadata": {
        "description": "The gallery that the workbook will been shown under. Supported values include workbook, tsg, etc. Usually, this is 'workbook'"
      }
    },
    "workbookSourceId": {
      "type": "string",
      "defaultValue": "",
      "metadata": {
        "description": "The id of resource instance to which the workbook will be associated"
      }
    },
    "workbookId": {
      "type": "string",
      "defaultValue": "[newGuid()]",
      "metadata": {
        "description": "The unique guid for this workbook instance"
      }
    }
  },
  "variables": {
    "workbookContent": {
      "version": "Notebook/1.0",
      "items": [
        {
          "type": 9,
          "content": {
            "version": "KqlParameterItem/1.0",
            "crossComponentResources": [
              "{Subscription}"
            ],
            "parameters": [
              {
                "id": "09060012-1a9b-46c2-a808-06eed756c11e",
                "version": "KqlParameterItem/1.0",
                "name": "Subscription",
                "type": 6,
                "isRequired": true,
                "typeSettings": {
                  "additionalResourceOptions": [
                    "value::1"
                  ],
                  "includeAll": true,
                  "showDefault": false
                },
                "defaultValue": "value::1"
              },
              {
                "id": "8575be38-a3cc-42d9-8680-b86c7e635100",
                "version": "KqlParameterItem/1.0",
                "name": "Workspace",
                "type": 5,
                "isRequired": true,
                "query": "where type =~ 'microsoft.operationalinsights/workspaces'\r\n| project value =id, label = name",
                "crossComponentResources": [
                  "{Subscription}"
                ],
                "typeSettings": {
                  "resourceTypeFilter": {
                    "microsoft.operationalinsights/workspaces": true
                  },
                  "additionalResourceOptions": [
                    "value::1"
                  ],
                  "showDefault": false
                },
                "timeContext": {
                  "durationMs": 86400000
                },
                "defaultValue": "value::1",
                "queryType": 1,
                "resourceType": "microsoft.resourcegraph/resources"
              },
              {
                "id": "f0ea0edf-6716-46e7-87a6-195db56b7fee",
                "version": "KqlParameterItem/1.0",
                "name": "TimeRange",
                "type": 4,
                "isRequired": true,
                "value": {
                  "durationMs": 7776000000
                },
                "typeSettings": {
                  "selectableValues": [
                    {
                      "durationMs": 300000
                    },
                    {
                      "durationMs": 900000
                    },
                    {
                      "durationMs": 1800000
                    },
                    {
                      "durationMs": 3600000
                    },
                    {
                      "durationMs": 14400000
                    },
                    {
                      "durationMs": 43200000
                    },
                    {
                      "durationMs": 86400000
                    },
                    {
                      "durationMs": 172800000
                    },
                    {
                      "durationMs": 259200000
                    },
                    {
                      "durationMs": 604800000
                    },
                    {
                      "durationMs": 1209600000
                    },
                    {
                      "durationMs": 2419200000
                    },
                    {
                      "durationMs": 2592000000
                    },
                    {
                      "durationMs": 5184000000
                    },
                    {
                      "durationMs": 7776000000
                    }
                  ],
                  "allowCustom": true
                },
                "timeContext": {
                  "durationMs": 86400000
                }
              },
              {
                "id": "9dee73cf-8dc3-4360-b2de-7daed8319fe8",
                "version": "KqlParameterItem/1.0",
                "name": "User",
                "type": 1,
                "isGlobal": true,
                "value": "."
              }
            ],
            "style": "above",
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          "name": "parameters - 0"
        },
        {
          "type": 1,
          "content": {
            "json": "# MFA Gap Analysis Workbook\r\n\r\n----"
          },
          "name": "text - 3"
        },
        {
          "type": 1,
          "content": {
            "json": "## Description and Instructions:\r\n<div><span style=\"font-size:14px;\">\r\nThis workbook is meant to show where users are signing in with single factor authentication <br>\r\nIt will also show conditional access policies that matched the signin, but because of an exclusion for the user in the policy, was allowed. <br>\r\n<span style=\"color:red\">**Note:**</span> To see the conditional access policies with exclusions you must utilize the accompanying powershell script to gather the data, <br> obtain a Sas url for the csv file created in azure blog storage, and finally enter the Sas url in the conditional access query step <br> **_(The last visualization in this workbook)_** <br>\r\n\r\nYou can find the Jupyter Notebook containing the required powershell for the conditional access exclusions **[On my Github Here](https://github.com/jostuffl/AzureSentinel_Stuff/blob/main/Notebooks/Conditional_Access_Exclusions.ipynb)**\r\n<br>\r\n<br></span></div>\r\n\r\n### Usage Instructions\r\n<div><span style=\"font-size:14px;\">\r\nTo use this workbook start by selecting an application tile in the **\"Sign-ins by Application\"** visualization. <br>\r\nThe tiles for this visualization show on the left the total sign-ins,<br>\r\non the right total single factor sign-ins, and below sign-ins over time.<br>\r\nThis will populate the table **\"Sign-ins and Status by UPN\"** <br>\r\nNext expand a user account row and select a sign-in. <br>\r\nThe Geo Map will update with sign-in locations for that user (Previously showing all sign-ins and their locations.)<br>\r\nAdditionally if you are leveraging the accompanying powershell jupyter notebook / script\r\nthe last visualization will populate with any matched conditional access policies that <br>\r\nthe user has exclusions for.\r\n </span></div>",
            "style": "info"
          },
          "name": "Description and Usage",
          "styleSettings": {
            "padding": "50",
            "showBorder": true
          }
        },
        {
          "type": 12,
          "content": {
            "version": "NotebookGroup/1.0",
            "groupType": "editable",
            "title": "Home Page",
            "items": [
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "SigninLogs\r\n| where UserPrincipalName !in((_GetWatchlist('HB')\r\n     | project SearchKey))\r\n| where ResultType == \"0\"\r\n| parse AuthenticationDetails with * '[' AuthDetails ']'\r\n| extend MfaDetail = iff( AuthenticationRequirement == \"singleFactorAuthentication\", \"Single Factor\", tostring(MfaDetail.authMethod))\r\n| project UserPrincipalName, ResultCode = ResultType, ResultDescription, App = AppDisplayName, AuthDetails ,AuthenticationRequirement, ClientAppUsed, DeviceDetail, IsInteractive,IPAddress, LocationDetails, MfaDetail,  Status\r\n| extend AuthenticationRequirement = iff(AuthenticationRequirement == \"singleFactorAuthentication\", \"Single-Factor\", \"Multi-Factor\")\r\n| summarize count() by AuthenticationRequirement",
                  "size": 0,
                  "timeContextFromParameter": "TimeRange",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "crossComponentResources": [
                    "{Workspace}"
                  ],
                  "visualization": "tiles",
                  "tileSettings": {
                    "showBorder": false,
                    "titleContent": {
                      "columnMatch": "AuthenticationRequirement",
                      "formatter": 1
                    },
                    "leftContent": {
                      "columnMatch": "count_",
                      "formatter": 12,
                      "formatOptions": {
                        "palette": "auto"
                      },
                      "numberFormat": {
                        "unit": 17,
                        "options": {
                          "maximumSignificantDigits": 3,
                          "maximumFractionDigits": 2
                        }
                      }
                    }
                  }
                },
                "customWidth": "10",
                "name": "query - 3"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "SigninLogs\r\n| summarize AppCount = count() by App = AppDisplayName\r\n| join ( SigninLogs\r\n| extend App = AppDisplayName\r\n| make-series AppCountTimeLine= count() default = 0 on TimeGenerated from {TimeRange:start} to {TimeRange:end} step {TimeRange:grain} by App) on App\r\n| join ( SigninLogs\r\n| extend App = AppDisplayName\r\n| where AuthenticationRequirement == \"singleFactorAuthentication\"\r\n| where ResultType == \"0\"\r\n| summarize SingleFactor = count() by App) on App\r\n| project App, AppCount, AppCountTimeLine, SingleFactor",
                  "size": 0,
                  "title": "Sign-ins by Application",
                  "timeContextFromParameter": "TimeRange",
                  "exportFieldName": "App",
                  "exportParameterName": "App",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "crossComponentResources": [
                    "{Workspace}"
                  ],
                  "visualization": "tiles",
                  "sortBy": [],
                  "tileSettings": {
                    "titleContent": {
                      "columnMatch": "App",
                      "formatter": 1,
                      "formatOptions": {
                        "compositeBarSettings": {
                          "labelText": "",
                          "columnSettings": [
                            {
                              "columnName": "EventCount",
                              "color": "redBright"
                            }
                          ]
                        }
                      }
                    },
                    "leftContent": {
                      "columnMatch": "AppCount",
                      "formatter": 12,
                      "formatOptions": {
                        "min": 0,
                        "palette": "categorical"
                      }
                    },
                    "rightContent": {
                      "columnMatch": "SingleFactor",
                      "formatter": 12,
                      "formatOptions": {
                        "min": 0,
                        "max": 1,
                        "palette": "yellow"
                      }
                    },
                    "secondaryContent": {
                      "columnMatch": "AppCountTimeLine",
                      "formatter": 9,
                      "formatOptions": {
                        "min": 0,
                        "palette": "greenRed"
                      }
                    },
                    "showBorder": true,
                    "size": "auto"
                  },
                  "chartSettings": {
                    "group": "EventID",
                    "createOtherGroup": 100,
                    "showLegend": true
                  }
                },
                "customWidth": "90",
                "name": "Apps"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "let CommonLocation = SigninLogs\r\n| extend User = iff(isnotempty(\"{User}\"),\"{User}\",\".\")\r\n| where UserPrincipalName contains User\r\n| where AuthenticationRequirement == \"singleFactorAuthentication\"\r\n| extend LAT = round(todouble(LocationDetails.geoCoordinates.latitude), 1)\r\n| extend LONG = round(todouble(LocationDetails.geoCoordinates.longitude), 1)\r\n| summarize Count=count() by LAT, LONG\r\n| top 1 by Count;\r\nlet CommonLAT = toscalar(CommonLocation\r\n| project LAT);\r\nlet CommonLONG = toscalar(CommonLocation\r\n| project LONG);\r\nSigninLogs\r\n| extend User = iff(isnotempty(\"{User}\"),\"{User}\",\".\")\r\n| where UserPrincipalName contains User\r\n| where AuthenticationRequirement == \"singleFactorAuthentication\"\r\n| extend LAT = round(todouble(LocationDetails.geoCoordinates.latitude), 1)\r\n| extend LONG = round(todouble(LocationDetails.geoCoordinates.longitude), 1)\r\n| extend MilesFromTypicalLocation = geo_distance_2points(CommonLONG, CommonLAT, LONG, LAT) / 1000 * 0.62137\r\n| extend LocationString= strcat(tostring(LocationDetails[\"countryOrRegion\"]), \"/\", tostring(LocationDetails[\"state\"]), \"/\", tostring(LocationDetails[\"city\"]))\r\n| summarize Count=count() by IPAddress, MilesFromTypicalLocation, LAT, LONG, LocationString",
                  "size": 0,
                  "timeContextFromParameter": "TimeRange",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "crossComponentResources": [
                    "{Workspace}"
                  ],
                  "visualization": "map",
                  "mapSettings": {
                    "locInfo": "LatLong",
                    "latitude": "LAT",
                    "longitude": "LONG",
                    "sizeSettings": "Count",
                    "sizeAggregation": "Sum",
                    "labelSettings": "LocationString",
                    "legendMetric": "Count",
                    "legendAggregation": "Sum",
                    "itemColorSettings": {
                      "nodeColorField": "MilesFromTypicalLocation",
                      "colorAggregation": "Sum",
                      "type": "heatmap",
                      "heatmapPalette": "greenRed"
                    }
                  }
                },
                "customWidth": "50",
                "name": "query - 3"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "SigninLogs\r\n| where AuthenticationRequirement == \"singleFactorAuthentication\"\r\n| where AppDisplayName == \"{App}\"\r\n| parse AuthenticationDetails with * '[' AuthDetails ']'\r\n| where ResultType == \"0\"\r\n| extend MfaDetail = iff( AuthenticationRequirement == \"singleFactorAuthentication\", \"Single Factor\", tostring(MfaDetail.authMethod))\r\n| project TimeGenerated,UserPrincipalName, ResultCode = ResultType, ResultDescription, App = AppDisplayName, AuthDetails ,AuthenticationRequirement, ClientAppUsed, DeviceDetail, IsInteractive,IPAddress, LocationDetails, MfaDetail, Status, CorrelationId\r\n",
                  "size": 0,
                  "title": "Sign-ins and Status by UPN",
                  "noDataMessage": "No sign-ins found for TimeRange",
                  "timeContextFromParameter": "TimeRange",
                  "exportedParameters": [
                    {
                      "fieldName": "UserPrincipalName",
                      "parameterName": "User",
                      "defaultValue": "."
                    },
                    {
                      "fieldName": "CorrelationId",
                      "parameterName": "CorrelationId",
                      "parameterType": 1
                    },
                    {
                      "fieldName": "UserPrincipalName",
                      "parameterName": "UserPrincipalName",
                      "parameterType": 1
                    }
                  ],
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "crossComponentResources": [
                    "{Workspace}"
                  ],
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "ResultCode",
                        "formatter": 5,
                        "formatOptions": {
                          "customColumnWidthSetting": "25ch"
                        }
                      },
                      {
                        "columnMatch": "ResultDescription",
                        "formatter": 18,
                        "formatOptions": {
                          "thresholdsOptions": "icons",
                          "thresholdsGrid": [
                            {
                              "operator": "is Empty",
                              "representation": "success",
                              "text": "Success"
                            },
                            {
                              "operator": "Default",
                              "thresholdValue": null,
                              "representation": "3",
                              "text": "Failed: {0}"
                            }
                          ]
                        }
                      },
                      {
                        "columnMatch": "App",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "AuthDetails",
                        "formatter": 7,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkLabel": "view",
                          "linkIsContextBlade": true
                        }
                      },
                      {
                        "columnMatch": "AuthenticationRequirement",
                        "formatter": 5,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkIsContextBlade": true
                        }
                      },
                      {
                        "columnMatch": "DeviceDetail",
                        "formatter": 5,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkIsContextBlade": true
                        }
                      },
                      {
                        "columnMatch": "LocationDetails",
                        "formatter": 5,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkIsContextBlade": true
                        }
                      },
                      {
                        "columnMatch": "Status",
                        "formatter": 5,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkIsContextBlade": true
                        }
                      },
                      {
                        "columnMatch": "CorrelationId",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "AuthenticationProcessingDetails",
                        "formatter": 7,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkIsContextBlade": false
                        }
                      },
                      {
                        "columnMatch": "AuthenticationDetails",
                        "formatter": 7,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkIsContextBlade": true
                        }
                      },
                      {
                        "columnMatch": "AuthProcDetails",
                        "formatter": 7,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkLabel": "view",
                          "linkIsContextBlade": true
                        }
                      }
                    ],
                    "hierarchySettings": {
                      "treeType": 1,
                      "groupBy": [
                        "UserPrincipalName"
                      ],
                      "finalBy": "App"
                    },
                    "sortBy": [
                      {
                        "itemKey": "TimeGenerated",
                        "sortOrder": 2
                      }
                    ]
                  },
                  "sortBy": [
                    {
                      "itemKey": "TimeGenerated",
                      "sortOrder": 2
                    }
                  ]
                },
                "name": "Sign-ins"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "let CASPFile = externaldata (PolicyName:string,PolicyId:string,ExcludedGroups:string,ExcludedUsers:string) [@\"ENTER YOUR SAS URL HERE\"] with (format=\"csv\",ignoreFirstRecord=true);\r\nSigninLogs\r\n| where CorrelationId == \"{CorrelationId}\"\r\n| where AuthenticationRequirement == \"singleFactorAuthentication\"\r\n| where AppDisplayName == \"{App}\"\r\n| extend ConditionalAccessPolicies = todynamic(ConditionalAccessPolicies)\r\n| mv-expand ConditionalAccessPolicies\r\n| extend CAPolicyName = tostring(parse_json(ConditionalAccessPolicies).displayName)\r\n| extend CAResult = tostring(parse_json(ConditionalAccessPolicies).result)\r\n| where ConditionalAccessPolicies.conditionsSatisfied > 0\r\n| project TimeGenerated,CAPolicyName, CAResult, UserPrincipalName\r\n| join CASPFile on $left.CAPolicyName == $right.PolicyName\r\n| summarize ExcludedGroups = make_set(ExcludedGroups), ExcludedUsers = make_set(ExcludedUsers), arg_max(TimeGenerated,*) by CAPolicyName\r\n| project CAPolicyName, ExcludedGroups,ExcludedUsers,TimeGenerated,CAResult, PolicyId, UserPrincipalName\r\n| where ExcludedUsers has UserPrincipalName",
                  "size": 0,
                  "showAnalytics": true,
                  "title": "Matched Conditional Access Policies with Exclusions",
                  "timeContextFromParameter": "TimeRange",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "crossComponentResources": [
                    "{Workspace}"
                  ],
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "CAPolicyName",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "ExcludedGroups",
                        "formatter": 7,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkLabel": "View",
                          "linkIsContextBlade": true
                        }
                      },
                      {
                        "columnMatch": "ExcludedUsers",
                        "formatter": 7,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkLabel": "View",
                          "linkIsContextBlade": true
                        }
                      }
                    ],
                    "hierarchySettings": {
                      "treeType": 1,
                      "groupBy": [
                        "CAPolicyName"
                      ]
                    }
                  }
                },
                "conditionalVisibility": {
                  "parameterName": "CorrelationId",
                  "comparison": "isNotEqualTo"
                },
                "name": "ConditionalAccess"
              }
            ]
          },
          "name": "HomePage"
        }
      ],
      "isLocked": false,
      "fallbackResourceIds": [
        ""
      ],
      "fromTemplateId": "sentinel-UserWorkbook"
    }
  },
  "resources": [
    {
      "name": "[parameters('workbookId')]",
      "type": "microsoft.insights/workbooks",
      "location": "[resourceGroup().location]",
      "apiVersion": "2021-03-08",
      "dependsOn": [],
      "kind": "shared",
      "properties": {
        "displayName": "[parameters('workbookDisplayName')]",
        "serializedData": "[string(variables('workbookContent'))]",
        "version": "1.0",
        "sourceId": "[parameters('workbookSourceId')]",
        "category": "[parameters('workbookType')]"
      }
    }
  ],
  "outputs": {
    "workbookId": {
      "type": "string",
      "value": "[resourceId( 'microsoft.insights/workbooks', parameters('workbookId'))]"
    }
  },
  "$schema": "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
}
