{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "# **User Reported Phishing Workbook**\r\n\r\n**This workbook is for investigating user reported phishing emails. In it you will find emails that have been reported, how many times they have been reported, how many people received the email, any attachments (with threatintel matching), any urls (with threatintel matching), and any device connections to the detected urls.**\r\n"
      },
      "customWidth": "50",
      "name": "text - 1"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 9,
            "content": {
              "version": "KqlParameterItem/1.0",
              "parameters": [
                {
                  "id": "b5f413b3-5a0e-4911-a4c0-6be24924f4d2",
                  "version": "KqlParameterItem/1.0",
                  "name": "Timerange",
                  "type": 4,
                  "isRequired": true,
                  "value": {
                    "durationMs": 7776000000
                  },
                  "typeSettings": {
                    "selectableValues": [
                      {
                        "durationMs": 14400000
                      },
                      {
                        "durationMs": 43200000
                      },
                      {
                        "durationMs": 86400000
                      },
                      {
                        "durationMs": 259200000
                      },
                      {
                        "durationMs": 604800000
                      },
                      {
                        "durationMs": 1209600000
                      },
                      {
                        "durationMs": 2419200000
                      },
                      {
                        "durationMs": 2592000000
                      },
                      {
                        "durationMs": 5184000000
                      },
                      {
                        "durationMs": 7776000000
                      }
                    ],
                    "allowCustom": true
                  }
                },
                {
                  "id": "e4854e2f-d1c2-46a3-a617-665f3346de40",
                  "version": "KqlParameterItem/1.0",
                  "name": "Subscription",
                  "type": 5,
                  "isRequired": true,
                  "query": "summarize by subscriptionId\r\n| project value = strcat(\"/subscriptions/\", subscriptionId), label = subscriptionId",
                  "crossComponentResources": [
                    "value::all"
                  ],
                  "value": null,
                  "typeSettings": {
                    "additionalResourceOptions": []
                  },
                  "queryType": 1,
                  "resourceType": "microsoft.resourcegraph/resources"
                },
                {
                  "id": "8033abe7-e07c-466f-ad26-a94963d0c632",
                  "version": "KqlParameterItem/1.0",
                  "name": "Workspace",
                  "type": 5,
                  "isRequired": true,
                  "query": "where type =~ \"microsoft.operationalinsights/workspaces\"\r\n| project subscriptionId,id,name\r\n| where '{Subscription}' has subscriptionId\r\n| project value =id, label = name",
                  "crossComponentResources": [
                    "value::all"
                  ],
                  "value": "",
                  "typeSettings": {
                    "additionalResourceOptions": [],
                    "showDefault": false
                  },
                  "queryType": 1,
                  "resourceType": "microsoft.resourcegraph/resources"
                },
                {
                  "id": "64cb2ab2-3c0d-45be-bd87-67d7decca54d",
                  "version": "KqlParameterItem/1.0",
                  "name": "MsgId",
                  "type": 1,
                  "description": "Global set MsgId",
                  "isGlobal": true,
                  "isHiddenWhenLocked": true,
                  "value": ""
                }
              ],
              "style": "above",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            "name": "parameters - 3"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "let Alerts = SecurityAlert\r\n| where DisplayName == \"User reported message as malicious\" or DisplayName == \"Email reported by user as malware or phish\"\r\n| project TimeGenerated,SystemAlertId,Entities, ExtendedLinks\r\n| mv-expand Entities= todynamic(Entities)\r\n| extend InternetMessageId = tostring(Entities.InternetMessageId) \r\n| where isnotempty(InternetMessageId)\r\n| summarize arg_max(TimeGenerated,*) by SystemAlertId\r\n| summarize arg_max(TimeGenerated,*), Reports = count() by InternetMessageId\r\n| where Reports > 0\r\n| extend AlertLink = tostring(parse_json(ExtendedLinks)[0].Href)\r\n| extend InvestigationLink = tostring(parse_json(ExtendedLinks)[1].Href)\r\n| project Reported = TimeGenerated, Reporter = Entities.Recipient, P2Sender = Entities.P2Sender, Subject = Entities.Subject, Reports, SystemAlertId, InternetMessageId,NetworkMessageId = Entities.NetworkMessageId, AlertLink, InvestigationLink ;\r\nlet Incidents = SecurityIncident\r\n| where Title == \"Email reported by user as malware or phish\" or Title == \"User reported message as malicious\"\r\n| where Status != \"Closed\"\r\n| summarize arg_max(TimeGenerated,*) by IncidentNumber\r\n| mv-expand AlertIds\r\n| extend AlertIds = tostring(AlertIds)\r\n| project AlertIds,Status,IncidentUrl;\r\n//\r\nIncidents\r\n| join Alerts\r\non $left.AlertIds == $right.SystemAlertId\r\n| project Status, Reported, Reporter, P2Sender, Subject, Reports, IncidentUrl, AlertLink, InvestigationLink, InternetMessageId, NetworkMessageId\r\n| sort by Reported desc",
              "size": 0,
              "title": "User Reported Phishing",
              "noDataMessage": "Shows what emails have been reported for phishing",
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "exportedParameters": [
                {
                  "fieldName": "InternetMessageId",
                  "parameterName": "MsgId",
                  "defaultValue": ""
                },
                {
                  "fieldName": "NetworkMessageId",
                  "parameterName": "NetworkMessageId",
                  "parameterType": 1
                }
              ],
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "Status",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "==",
                          "thresholdValue": "New",
                          "representation": "warning",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Active",
                          "representation": "pending",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "pending",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "P2Sender",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "25ch"
                    }
                  },
                  {
                    "columnMatch": "Subject",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "25ch"
                    }
                  },
                  {
                    "columnMatch": "IncidentUrl",
                    "formatter": 7,
                    "formatOptions": {
                      "linkTarget": "Url",
                      "linkLabel": "Incident Link"
                    }
                  },
                  {
                    "columnMatch": "AlertLink",
                    "formatter": 7,
                    "formatOptions": {
                      "linkTarget": "Url",
                      "linkLabel": "M365 Alert"
                    }
                  },
                  {
                    "columnMatch": "InvestigationLink",
                    "formatter": 7,
                    "formatOptions": {
                      "linkTarget": "Url",
                      "linkLabel": "M365 Investigation"
                    }
                  },
                  {
                    "columnMatch": "InternetMessageId",
                    "formatter": 5
                  },
                  {
                    "columnMatch": "NetworkMessageId",
                    "formatter": 5
                  },
                  {
                    "columnMatch": "Sender",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "25ch"
                    }
                  }
                ],
                "filter": true
              },
              "sortBy": []
            },
            "customWidth": "100",
            "showPin": false,
            "name": "query - 0",
            "styleSettings": {
              "maxWidth": "100"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| where InternetMessageId == \"{MsgId}\"\r\n| project-rename Recipient = RecipientEmailAddress\r\n| distinct Recipient\r\n| sort by Recipient asc",
              "size": 0,
              "title": "Received Users",
              "noDataMessage": "No email selected.",
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ]
            },
            "customWidth": "30",
            "name": "Users",
            "styleSettings": {
              "margin": "0px",
              "padding": "0px",
              "maxWidth": "30"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| where InternetMessageId == \"{MsgId}\"\r\n| summarize Title = \"# of Received Users\", dcount(RecipientEmailAddress)",
              "size": 4,
              "noDataMessage": "No email selected.",
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "exportFieldName": "Users",
              "exportParameterName": "Users",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "tiles",
              "tileSettings": {
                "titleContent": {
                  "columnMatch": "Title",
                  "formatter": 1
                },
                "leftContent": {
                  "columnMatch": "dcount_RecipientEmailAddress",
                  "formatter": 12,
                  "formatOptions": {
                    "min": 1,
                    "palette": "redBright"
                  }
                },
                "showBorder": true
              },
              "textSettings": {
                "style": "bignumber"
              }
            },
            "customWidth": "0",
            "name": "ReceivedUsers",
            "styleSettings": {
              "margin": "100px",
              "maxWidth": "100"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailAttachmentInfo\r\n| where NetworkMessageId == \"{NetworkMessageId}\"\r\n| summarize arg_max(TimeGenerated,*) by SHA256\r\n| project FileName, FileType, SHA256, ThreatNames",
              "size": 1,
              "title": "Email Attachments",
              "noDataMessage": "No attachments for the selected email or no email selected.",
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "exportFieldName": "SHA256",
              "exportParameterName": "SHA256",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "FileName",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "1",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "ThreatNames",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "10%"
                    }
                  }
                ],
                "sortBy": [
                  {
                    "itemKey": "SHA256",
                    "sortOrder": 1
                  }
                ]
              },
              "sortBy": [
                {
                  "itemKey": "SHA256",
                  "sortOrder": 1
                }
              ]
            },
            "customWidth": "50",
            "name": "Files",
            "styleSettings": {
              "maxWidth": "50"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "ThreatIntelligenceIndicator\r\n| where FileHashValue == \"{SHA256}\"\r\n| summarize arg_max(TimeGenerated, *) by FileHashValue\r\n| project Action, ConfidenceScore, Description,ThreatType, Tags, SourceSystem",
              "size": 1,
              "title": "File Threat Intel Matches",
              "noDataMessage": "The selected file hash does not match any available threat intel.",
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "Action",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "==",
                          "thresholdValue": "alert",
                          "representation": "2",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "block",
                          "representation": "3",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "2",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "ConfidenceScore",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "colors",
                      "thresholdsGrid": [
                        {
                          "operator": ">=",
                          "thresholdValue": "75",
                          "representation": "redBright",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": ">=",
                          "thresholdValue": "50",
                          "representation": "orange",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": ">",
                          "thresholdValue": "25",
                          "representation": "yellow",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "<=",
                          "thresholdValue": "25",
                          "representation": "blue",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "blue",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "FileHashValue",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "66ch"
                    }
                  }
                ],
                "labelSettings": [
                  {
                    "columnId": "ConfidenceScore",
                    "label": "Score"
                  },
                  {
                    "columnId": "ThreatType",
                    "label": "Type"
                  },
                  {
                    "columnId": "SourceSystem",
                    "label": "Source"
                  }
                ]
              }
            },
            "customWidth": "50",
            "name": "query - 4",
            "styleSettings": {
              "maxWidth": "50"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailUrlInfo\r\n| where NetworkMessageId == \"{NetworkMessageId}\"\r\n| project FullUrl = UrlDomain\r\n| distinct FullUrl\r\n| extend Domain = split(FullUrl,\".\")\r\n| extend Domain = strcat(Domain[-2],\".\",Domain[-1])",
              "size": 1,
              "title": "Urls in Email Body",
              "noDataMessage": "No Urls detected in email or no email selected.",
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "exportedParameters": [
                {
                  "fieldName": "FullUrl",
                  "parameterName": "FullUrl",
                  "parameterType": 1
                },
                {
                  "fieldName": "Domain",
                  "parameterName": "Domain",
                  "parameterType": 1
                }
              ],
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "FullUrl",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "1",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  }
                ]
              }
            },
            "customWidth": "50",
            "name": "Urls",
            "styleSettings": {
              "maxWidth": "50"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "ThreatIntelligenceIndicator\r\n| where DomainName has \"{Domain}\" or Url has \"{Domain}\" or DomainName has \"{FullUrl}\" or Url has \"{FullUrl}\"\r\n| extend Url = iff(isnotempty(Url),Url,DomainName)\r\n| summarize arg_max(TimeGenerated,*) by Url\r\n| project Action, Url, ConfidenceScore, Description,ThreatType, Tags, SourceSystem",
              "size": 1,
              "title": "Url Threat Intel Matches",
              "noDataMessage": "The selected url does not match any available threat intel.",
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "Action",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "2",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "ConfidenceScore",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "colors",
                      "thresholdsGrid": [
                        {
                          "operator": ">=",
                          "thresholdValue": "75",
                          "representation": "redBright",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": ">=",
                          "thresholdValue": "50",
                          "representation": "orange",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": ">",
                          "thresholdValue": "25",
                          "representation": "yellow",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "<=",
                          "thresholdValue": "25",
                          "representation": "blue",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  }
                ]
              }
            },
            "customWidth": "50",
            "name": "TIUrl",
            "styleSettings": {
              "maxWidth": "50"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "DeviceNetworkEvents\r\n| where isnotempty(RemoteUrl)\r\n| where RemoteUrl has \"{Domain}\" //Can change Domain to FullUrl to see all results that have domain name\r\n| summarize count() by bin(TimeGenerated,1d), RemoteUrl ",
              "size": 0,
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "timechart"
            },
            "name": "query - 9"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "DeviceNetworkEvents\r\n| where isnotempty(RemoteUrl)\r\n| where RemoteUrl has \"{FullUrl}\" or RemoteUrl has \"{Domain}\"\r\n| project TimeGenerated, ActionType, DeviceName,User = InitiatingProcessAccountUpn, UserDomain = InitiatingProcessAccountDomain, Process = InitiatingProcessFileName, PID = InitiatingProcessId, LocalIP, Protocol, RemoteIP,RemotePort, RemoteUrl\r\n| sort by TimeGenerated desc",
              "size": 0,
              "timeContext": {
                "durationMs": 7776000000
              },
              "timeContextFromParameter": "Timerange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ]
            },
            "name": "query - 8"
          }
        ]
      },
      "name": "MainGroup"
    }
  ],
  "fallbackResourceIds": [
    ""
  ],
  "fromTemplateId": "Reported-Phishing-Investigation",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}
